[
  "table-editor-obsidian",
  "buttons",
  "url-into-selection",
  "obsidian-emoji-toolbar",
  "obsidian-dictionary-plugin",
  "obsidian-banners",
  "obsidian-plantuml",
  "obsidian-mind-map",
  "calendar",
  "cm-typewriter-scroll-obsidian"
]